<?php

namespace App\Support\Enum;

final class DateFormats
{
    public const RU_SHORT = [
        'янв',
        'февр',
        'март',
        'апр',
        'май',
        'июнь',
        'июль',
        'авг',
        'сент',
        'окт',
        'нояб',
        'дек',
    ];

    public const  RU_LONG = [[
        'январь',
        'февраль',
        'март',
        'апрель',
        'май',
        'июнь',
        'июль',
        'август',
        'сентябрь',
        'октябрь',
        'ноябрь',
        'декабрь',
    ], [
        'января',
        'февраля',
        'марта',
        'апреля',
        'мая',
        'июня',
        'июля',
        'августа',
        'сентября',
        'октября',
        'ноября',
        'декабря',
    ]];
}
